<!DOCTYPE html>
<html>
<head>
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/4.1.1/css/bootstrap.min.css" rel="stylesheet" id="bootstrap-css">
    <script src="//maxcdn.bootstrapcdn.com/bootstrap/4.1.1/js/bootstrap.min.js"></script>
    <script src="//code.jquery.com/jquery-1.11.1.min.js"></script>
    <!------ Include the above in your HEAD tag ---------->
    <style>

        /* BASIC */

        html {
            background-color: #56baed;
        }

        body {
            font-family: "Poppins", sans-serif;
            height: 100vh;
        }

        a {
            color: #92badd;
            display:inline-block;
            text-decoration: none;
            font-weight: 400;
        }

        h2 {
            text-align: center;
            font-size: 16px;
            font-weight: 600;
            text-transform: uppercase;
            display:inline-block;
            margin: 40px 8px 10px 8px;
            color: #cccccc;
        }



        /* STRUCTURE */

        .wrapper {
            display: flex;
            align-items: center;
            flex-direction: column;
            justify-content: center;
            width: 100%;
            min-height: 100%;
            padding: 20px;
        }

        #formContent {
            -webkit-border-radius: 10px 10px 10px 10px;
            border-radius: 10px 10px 10px 10px;
            background: #fff;
            padding: 30px;
            width: 90%;
            max-width: 450px;
            position: relative;
            padding: 0px;
            -webkit-box-shadow: 0 30px 60px 0 rgba(0,0,0,0.3);
            box-shadow: 0 30px 60px 0 rgba(0,0,0,0.3);
            text-align: center;
        }

        #formFooter {
            background-color: #f6f6f6;
            border-top: 1px solid #dce8f1;
            padding: 25px;
            text-align: center;
            -webkit-border-radius: 0 0 10px 10px;
            border-radius: 0 0 10px 10px;
        }



        /* TABS */

        h2.inactive {
            color: #cccccc;
        }

        h2.active {
            color: #0d0d0d;
            border-bottom: 2px solid #5fbae9;
        }



        /* FORM TYPOGRAPHY*/

        input[type=button], input[type=submit], input[type=reset]  {
            background-color: #56baed;
            border: none;
            color: white;
            padding: 15px 80px;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            text-transform: uppercase;
            font-size: 13px;
            -webkit-box-shadow: 0 10px 30px 0 rgba(95,186,233,0.4);
            box-shadow: 0 10px 30px 0 rgba(95,186,233,0.4);
            -webkit-border-radius: 5px 5px 5px 5px;
            border-radius: 5px 5px 5px 5px;
            margin: 5px 20px 40px 20px;
            -webkit-transition: all 0.3s ease-in-out;
            -moz-transition: all 0.3s ease-in-out;
            -ms-transition: all 0.3s ease-in-out;
            -o-transition: all 0.3s ease-in-out;
            transition: all 0.3s ease-in-out;
        }

        input[type=button]:hover, input[type=submit]:hover, input[type=reset]:hover  {
            background-color: #39ace7;
        }

        input[type=button]:active, input[type=submit]:active, input[type=reset]:active  {
            -moz-transform: scale(0.95);
            -webkit-transform: scale(0.95);
            -o-transform: scale(0.95);
            -ms-transform: scale(0.95);
            transform: scale(0.95);
        }

        input[type=text], input[type=password]{
            background-color: #f6f6f6;
            border: none;
            color: #0d0d0d;
            padding: 15px 32px;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            font-size: 16px;
            margin: 5px;
            width: 85%;
            border: 2px solid #f6f6f6;
            -webkit-transition: all 0.5s ease-in-out;
            -moz-transition: all 0.5s ease-in-out;
            -ms-transition: all 0.5s ease-in-out;
            -o-transition: all 0.5s ease-in-out;
            transition: all 0.5s ease-in-out;
            -webkit-border-radius: 5px 5px 5px 5px;
            border-radius: 5px 5px 5px 5px;
        }

        input[type=text]:focus,input[type=password]:focus {
            background-color: #fff;
            border-bottom: 2px solid #5fbae9;
        }

        input[type=text]:placeholder {
            color: #cccccc;
        }



        /* ANIMATIONS */

        /* Simple CSS3 Fade-in-down Animation */
        .fadeInDown {
            -webkit-animation-name: fadeInDown;
            animation-name: fadeInDown;
            -webkit-animation-duration: 1s;
            animation-duration: 1s;
            -webkit-animation-fill-mode: both;
            animation-fill-mode: both;
        }

        @-webkit-keyframes fadeInDown {
            0% {
                opacity: 0;
                -webkit-transform: translate3d(0, -100%, 0);
                transform: translate3d(0, -100%, 0);
            }
            100% {
                opacity: 1;
                -webkit-transform: none;
                transform: none;
            }
        }

        @keyframes fadeInDown {
            0% {
                opacity: 0;
                -webkit-transform: translate3d(0, -100%, 0);
                transform: translate3d(0, -100%, 0);
            }
            100% {
                opacity: 1;
                -webkit-transform: none;
                transform: none;
            }
        }

        /* Simple CSS3 Fade-in Animation */
        @-webkit-keyframes fadeIn { from { opacity:0; } to { opacity:1; } }
        @-moz-keyframes fadeIn { from { opacity:0; } to { opacity:1; } }
        @keyframes fadeIn { from { opacity:0; } to { opacity:1; } }

        .fadeIn {
            opacity:0;
            -webkit-animation:fadeIn ease-in 1;
            -moz-animation:fadeIn ease-in 1;
            animation:fadeIn ease-in 1;

            -webkit-animation-fill-mode:forwards;
            -moz-animation-fill-mode:forwards;
            animation-fill-mode:forwards;

            -webkit-animation-duration:1s;
            -moz-animation-duration:1s;
            animation-duration:1s;
        }

        .fadeIn.first {
            -webkit-animation-delay: 0.4s;
            -moz-animation-delay: 0.4s;
            animation-delay: 0.4s;
        }

        .fadeIn.second {
            -webkit-animation-delay: 0.6s;
            -moz-animation-delay: 0.6s;
            animation-delay: 0.6s;
        }

        .fadeIn.third {
            -webkit-animation-delay: 0.8s;
            -moz-animation-delay: 0.8s;
            animation-delay: 0.8s;
        }

        .fadeIn.fourth {
            -webkit-animation-delay: 1s;
            -moz-animation-delay: 1s;
            animation-delay: 1s;
            cursor: pointer;
        }

        /* Simple CSS3 Fade-in Animation */
        .underlineHover:after {
            display: block;
            left: 0;
            bottom: -10px;
            width: 0;
            height: 2px;
            background-color: #56baed;
            content: "";
            transition: width 0.2s;
        }

        .underlineHover:hover {
            color: #0d0d0d;
        }

        .underlineHover:hover:after{
            width: 100%;
        }

        h1{
            color:#60a0ff;
        }

        /* OTHERS */

        *:focus {
            outline: none;
        }

        #icon {
            width:30%;
        }

    </style>
</head>

<body>
<div class="wrapper fadeInDown">
    <div id="formContent">
        <!-- Tabs Titles -->

        <!-- Icon -->
        <div class="fadeIn first" style="padding: 20px">
            @if(\Session::has('error'))
                <div class="alert alert-danger" role="alert">
                    {!! \Session::get('error') !!}
                </div>
            @endif
            <svg class="main-logo img-fluid" style="margin-top: 20px" width="175" height="40" viewBox="0 0 1473 340" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M0 1.00101L0 339.176H338.175V1.00101H0Z" fill="#B53138"></path>
                <path d="M158.513 80.7259C158.513 80.7259 151.296 76.8852 143.177 78.8057C135.959 80.7261 120.623 87.4477 115.21 93.209C109.797 98.9703 107.993 102.811 104.384 100.891C101.678 98.9702 91.7538 94.1691 96.2645 87.4476C96.2645 87.4476 100.775 85.527 106.188 85.527C111.601 85.527 129.644 64.4023 136.861 64.4023C144.079 64.4023 157.611 74.9646 158.513 80.7259Z" fill="white"></path>
                <path d="M124.006 196.494C124.006 196.494 120.367 212.491 110.361 215.491C100.354 219.49 97.6252 223.489 89.4381 238.486C80.3413 253.484 73.9736 255.483 73.9736 255.483C73.9736 255.483 75.793 272.48 84.8897 261.482C93.9865 251.484 103.993 240.486 118.548 230.488C133.103 220.49 124.006 196.494 124.006 196.494Z" fill="white"></path>
                <path d="M131.323 170.252C131.323 170.252 123.984 181.906 122.149 197.147C120.314 211.491 117.561 225.835 101.964 239.282C87.2846 252.73 84.5322 259.902 84.5322 259.902C84.5322 259.902 99.2118 242.868 112.974 238.386C126.736 233.007 130.406 233.007 134.076 228.524C137.746 224.042 144.168 204.319 142.333 200.733C141.416 196.25 136.828 167.562 131.323 170.252Z" fill="white"></path>
                <g opacity="0.3">
                    <path opacity="0.3" d="M132.087 232.555C130.912 232.555 130.912 232.555 129.738 233.474C128.564 233.474 128.564 233.474 127.39 233.474C126.215 233.474 126.215 233.474 125.041 233.474C123.867 233.474 123.867 232.555 122.693 232.555C122.693 232.555 121.519 231.636 121.519 230.717C121.519 229.798 121.519 229.798 121.519 228.879C121.519 227.96 121.519 227.041 121.519 225.203C121.519 223.365 122.693 220.609 123.867 218.771C125.041 216.933 126.215 215.095 127.39 212.338C126.215 214.176 125.041 216.014 123.867 218.771C122.693 220.609 122.693 223.365 122.693 225.203C122.693 226.122 122.693 227.041 122.693 227.96C122.693 228.879 122.693 228.879 122.693 229.798C122.693 230.717 123.867 230.717 123.867 230.717C125.041 231.636 126.215 231.636 127.39 231.636C128.564 231.636 130.912 231.636 132.087 232.555Z" fill="white"></path>
                </g>
                <path d="M141.742 143.954C141.742 143.954 122.238 148.435 127.811 174.427C133.383 200.419 140.813 216.552 134.312 228.204C134.312 228.204 157.53 199.523 158.459 178.012C159.388 157.398 148.243 141.265 141.742 143.954Z" fill="white"></path>
                <path d="M218.266 189.541C218.266 189.541 198.972 177.56 182.434 197.243C164.977 216.927 161.302 210.936 161.302 210.936C161.302 210.936 153.033 221.206 164.977 222.918C164.977 222.918 190.703 206.657 210.916 202.378C230.211 196.387 218.266 189.541 218.266 189.541Z" fill="white"></path>
                <path d="M227.547 123.082C227.547 123.082 247.657 117.272 257.274 107.591C266.892 97.9087 259.897 96.9404 265.143 92.0995C265.143 92.0995 268.641 89.195 272.138 92.0995C275.635 95.0041 275.635 103.718 272.138 104.686C268.641 106.622 261.646 112.431 248.531 129.859C248.531 129.859 224.05 140.509 227.547 123.082Z" fill="white"></path>
                <path d="M217.318 103.75C219.977 96.1346 222.636 108.509 227.954 118.029C232.385 127.548 242.134 135.163 248.338 131.355C248.338 131.355 238.589 147.538 227.067 142.778C215.546 138.019 203.138 119.933 206.683 110.413C209.342 101.846 216.432 108.509 217.318 103.75Z" fill="white"></path>
                <path d="M270.984 106.661C270.984 106.661 273.265 103.802 272.505 102.85C271.745 100.944 269.464 104.755 267.943 102.85C266.423 100.944 262.622 95.2276 264.903 92.3694C267.943 89.5111 272.505 90.4638 274.025 96.1803C275.546 102.849 274.785 105.708 270.984 106.661Z" fill="white"></path>
                <path d="M246.995 54.781C242.436 48.393 226.021 44.7427 217.813 54.781C209.606 64.8193 218.725 71.2072 215.078 76.6827C211.43 82.1581 206.87 78.5079 206.87 78.5079C195.927 61.1691 176.776 69.382 158.538 62.0815C140.299 54.7809 132.092 67.5569 132.092 67.5569C140.299 63.9067 144.859 71.2072 151.242 75.77C155.802 79.4203 164.921 83.0706 174.041 84.8957C171.305 93.1089 164.921 110.448 143.035 140.563C143.035 140.563 133.004 160.639 149.418 164.29C165.833 167.94 171.305 150.601 171.305 150.601C171.305 150.601 168.569 145.126 182.248 137.825C192.279 132.35 198.663 128.699 202.311 124.136C219.637 122.311 221.461 104.972 221.461 96.7593C221.461 87.6336 226.933 83.0708 226.933 83.0708C226.933 83.0708 236.052 88.546 239.7 88.546C243.348 88.546 251.555 61.169 246.995 54.781Z" fill="white"></path>
                <path d="M140.686 143.66C140.686 143.66 129.558 169.493 148.104 179.641C165.722 190.713 204.668 179.642 213.941 187.945C223.214 195.326 213.941 201.784 213.941 201.784C213.941 201.784 231.559 199.016 232.487 185.177C232.487 172.261 204.668 149.196 171.286 151.963C136.049 154.731 140.686 143.66 140.686 143.66Z" fill="white"></path>
                <g opacity="0.3">
                    <path opacity="0.3" d="M232.485 183.26C232.485 183.26 232.485 183.977 232.485 183.26C232.485 183.977 232.485 183.977 231.639 183.977C231.639 183.977 231.639 184.693 230.794 184.693C230.794 185.409 229.948 185.41 229.103 185.41C228.257 186.126 226.566 186.126 225.721 185.41C224.876 185.41 223.185 184.693 222.339 183.977C221.494 183.26 220.648 182.544 219.803 182.544C218.112 181.111 216.421 179.678 215.576 178.961C213.885 177.528 212.194 176.095 211.349 175.379C213.04 176.812 214.73 177.528 216.421 178.961C218.112 180.394 219.803 181.827 221.494 182.544C222.339 183.26 223.185 183.26 224.03 183.977C224.876 184.693 225.721 184.693 226.567 184.693C227.412 184.693 228.257 184.693 229.103 184.693L229.948 183.977C229.948 183.977 229.948 183.977 229.948 183.26H232.485Z" fill="white"></path>
                </g>
                <path d="M161.553 210.472C161.553 210.472 164.778 210.472 162.628 208.611C160.478 206.749 149.727 206.749 147.576 207.68C146.501 208.61 144.351 212.333 145.426 222.572C145.426 222.572 146.501 224.433 143.276 228.156C140.051 231.879 134.675 241.186 138.975 249.563C143.276 257.94 150.802 254.217 150.802 250.494C150.802 246.771 151.877 237.464 158.328 232.81C158.328 232.81 169.079 229.087 169.079 225.364C168.004 222.572 161.553 218.849 160.478 219.779C159.403 220.71 159.403 212.333 161.553 210.472Z" fill="white"></path>
                <path opacity="0.42" d="M163.772 221.388C163.772 221.388 158.944 222.273 156.048 231.122C153.152 239.971 149.29 221.388 162.806 218.733C176.323 215.193 163.772 221.388 163.772 221.388Z" fill="white"></path>
                <g opacity="0.3">
                    <path opacity="0.3" d="M157.187 254.631C155.866 254.631 154.546 253.574 154.546 253.574C153.224 253.574 153.224 252.518 151.903 252.518C150.582 251.461 149.261 250.404 147.94 248.29C147.94 246.177 147.94 245.12 147.94 243.006C147.94 240.893 149.261 239.836 149.261 238.779C149.261 239.836 147.94 241.95 147.94 244.063C147.94 246.177 147.94 247.234 149.261 248.29C150.582 249.347 150.582 251.461 153.224 252.518C154.545 252.518 154.545 253.574 155.866 253.574C157.187 253.574 157.187 254.631 158.508 254.631H157.187Z" fill="white"></path>
                </g>
                <path d="M72.7959 254.613C72.7959 254.613 70.0438 254.613 67.2917 256.438C64.5397 258.263 58.1182 255.526 58.1182 261C58.1182 266.474 63.6224 274.685 68.2092 277.422C72.7959 280.159 70.0439 292.932 80.1348 295.669C90.2258 298.406 94.8125 295.669 94.8125 295.669C94.8125 295.669 96.6472 290.195 91.1431 289.282C85.6389 289.282 81.9695 279.247 84.7216 274.685C87.4737 270.123 88.3911 265.561 87.4737 264.649C86.5564 263.737 83.8042 261.912 81.0521 262.824C78.3 262.824 72.7959 263.737 72.7959 254.613Z" fill="white"></path>
                <path d="M441.456 303.26H405.992V335.875H384V254H445.028V269.239H405.992V288.077H441.456V303.26Z" fill="#234492"></path>
                <path d="M587.965 254V307.59C587.965 313.663 586.524 318.93 583.642 323.392C580.759 327.815 576.624 331.189 571.236 333.514C565.847 335.838 559.477 337 552.125 337C541.014 337 532.263 334.413 525.872 329.24C519.481 324.066 516.223 316.981 516.098 307.984V254H538.216V308.377C538.466 317.337 543.103 321.817 552.125 321.817C556.678 321.817 560.124 320.692 562.464 318.443C564.803 316.194 565.972 312.539 565.972 307.478V254H587.965Z" fill="#234492"></path>
                <path d="M740.175 335.875H718.308L685.977 284.928V335.875H663.985V254H685.977L718.246 304.947V254H740.175V335.875Z" fill="#234492"></path>
                <path d="M816.321 335.875V254H845.707C853.769 254 861.016 255.65 867.449 258.949C873.881 262.21 878.894 266.84 882.486 272.838C886.12 278.799 887.958 285.491 888 292.913V296.681C888 304.179 886.225 310.908 882.674 316.869C879.165 322.792 874.195 327.44 867.762 330.814C861.371 334.151 854.228 335.838 846.333 335.875H816.321ZM838.313 269.239V320.692H845.957C852.265 320.692 857.11 318.687 860.494 314.675C863.877 310.627 865.569 304.629 865.569 296.681V293.138C865.569 285.228 863.877 279.267 860.494 275.256C857.11 271.245 852.181 269.239 845.707 269.239H838.313Z" fill="#234492"></path>
                <path d="M643.52 57H712.047V1H521.207C558.573 4.2 567.822 39.6654 567.776 56.998L588.479 57V215.023H643.52V57Z" fill="#F05927"></path>
                <path d="M495.435 156.796C495.435 149.452 492.725 143.73 487.303 139.629C481.98 135.527 472.566 131.283 459.062 126.896C445.557 122.509 434.517 118.264 425.941 114.163C398.045 100.906 384.097 82.6893 384.097 59.513C384.097 47.9725 387.547 37.815 394.447 29.0405C401.446 20.1705 411.303 13.3035 424.019 8.43931C436.735 3.47977 451.028 1 466.898 1C482.374 1 496.224 3.67052 508.447 9.01156C520.769 14.3526 530.33 21.9827 537.132 31.9017C542.342 39.4275 545.557 47.793 546.776 56.998H494.462C493.196 52.5521 490.859 48.8601 487.451 45.922C482.128 41.2486 474.883 38.9118 465.716 38.9118C456.45 38.9118 449.106 40.9147 443.685 44.9205C438.362 48.8309 435.7 53.8381 435.7 59.9422C435.7 65.2832 438.657 70.1474 444.572 74.5347C450.486 78.8266 460.886 83.3092 475.77 87.9826C490.655 92.5607 502.878 97.5202 512.439 102.861C535.702 115.832 547.334 133.715 547.334 156.51C547.334 174.727 540.237 189.033 526.042 199.429C511.848 209.825 492.38 215.023 467.638 215.023C450.19 215.023 434.369 212.019 420.175 206.01C406.079 199.906 395.433 191.608 388.237 181.117C387.734 180.476 387.287 179.77 386.89 179.019C384.282 174.083 383.848 167.197 384 164H434.107C435.325 166.04 436.793 167.836 438.51 169.386C444.522 174.631 454.232 177.254 467.638 177.254C476.214 177.254 482.966 175.49 487.895 171.961C492.922 168.337 495.435 163.282 495.435 156.796Z" fill="#B53138"></path>
                <path d="M1277 139.172V0H1223.14V138.882C1223.14 151.931 1220.28 161.355 1214.55 167.154C1208.82 172.954 1200.38 175.854 1189.23 175.854C1167.13 175.854 1155.78 164.303 1155.17 141.202V77.5H1101V140.187C1101.31 163.385 1109.29 181.653 1124.94 194.992C1140.59 208.331 1162.02 215 1189.23 215C1207.23 215 1222.83 212.004 1236.03 206.011C1249.23 200.018 1259.35 191.319 1266.41 179.913C1273.47 168.411 1277 154.831 1277 139.172Z" fill="#8E2872"></path>
                <path d="M1353.94 215.023V163.998H1391.33C1402.17 163.924 1412.5 161.735 1421.94 157.824C1451.48 145.582 1472.26 116.468 1472.26 82.5C1472.26 37.4888 1435.77 1 1390.76 1H1297.73V56.998H1297.95H1348.45H1394.95C1408.76 56.998 1419.95 68.1909 1419.95 81.998V82.998C1419.95 96.8052 1408.76 107.998 1394.95 107.998H1348.45H1297.95L1297.73 108.012V215.023H1353.94Z" fill="#C82038"></path>
                <path d="M732.232 164H793.232L810.413 215.023H863.995L787.531 1H735.898L773.232 108H700.232L664.732 215.023H718.03L732.232 164Z" fill="#E9A424"></path>
                <path d="M1080.71 56.998H1155V1H975C990.5 4.5 1010.5 28 1013 56.998H1025.37V215.023H1080.71V56.998Z" fill="#234492"></path>
                <path d="M867.056 164.003H896.621L934.843 215.023L997.233 215H1000.73L948.422 143.858C975.425 132.667 994.42 106.054 994.42 75.0044C994.42 33.8592 961.065 1 919.92 1L903.295 1.00034H808.732L828.732 56.9984H864.452H910.952C924.759 56.9984 935.952 68.1913 935.952 81.9984V82.9984C935.952 96.8055 924.759 107.998 910.952 107.998H864.452H847.232L867.056 164.003Z" fill="#15A88E"></path>
            </svg>
        </div>
            <!-- Login Form -->
        <form class="form-horizontal" id="login-form" role="form" style="display: block;"  method="POST" action="{{ route('allow_access') }}">
        {{ csrf_field() }}
            <input type="text" id="login" class="fadeIn second" name="login" placeholder="Login">
            <input type="password" id="password" class="fadeIn third" name="password" placeholder="Mot de passe">
            <input type="submit" class="fadeIn fourth" value="Accéder">
        </form>
    </div>
</div>
</body>
</html>

